In [1]:
print("ok")

ok

[Data Link](https://www.kaggle.com/datasets/ra4u12/bookrecommendation)

In [2]:
import pandas as pd
import numpy as np

In [10]:
books = pd.read_csv("BX-Books.csv", encoding='ISO-8859-1', sep=';', on_bad_lines='skip', low_memory=False)

Data Exploration

In [11]:
books.head(2)

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher,Image-URL-S,Image-URL-M,Image-URL-L
0,0195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...
1,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...

In [21]:
books.iloc[50]['Image-URL-L']

'http://images.amazon.com/images/P/0812523873.01.LZZZZZZZ.jpg'

#we want only this 'ISBN','Book-Title', 'Book-Author', 'Year-Of-Publication', 'Publisher','Image-URL-L'

In [22]:
books = books[['ISBN','Book-Title', 'Book-Author', 'Year-Of-Publication', 'Publisher','Image-URL-L']]

In [24]:
# books.head()
# books.shape
# books.index
# books.columns
# books.dtypes
# books.nunique()
# books.count()
# books.info()

In [29]:
# books.head(2)
# books.shape
# books.index
# books.columns
# books.dtypes
# books.nunique()
# books.count()
# books.info()

In [28]:
books.head(2)

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher,Image-URL-L
0,0195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press,http://images.amazon.com/images/P/0195153448.0...
1,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,http://images.amazon.com/images/P/0002005018.0...

In [27]:
books.shape

(271360, 6)

In [31]:
books.columns

Index(['ISBN', 'Book-Title', 'Book-Author', 'Year-Of-Publication', 'Publisher',
       'Image-URL-L'],
      dtype='object')

In [32]:
books.dtypes

ISBN                   object
Book-Title             object
Book-Author            object
Year-Of-Publication    object
Publisher              object
Image-URL-L            object
dtype: object

In [33]:
books.nunique()

ISBN                   271360
Book-Title             242135
Book-Author            102022
Year-Of-Publication       118
Publisher               16807
Image-URL-L            271041
dtype: int64

In [34]:
books.count()

ISBN                   271360
Book-Title             271360
Book-Author            271358
Year-Of-Publication    271360
Publisher              271358
Image-URL-L            271357
dtype: int64

In [35]:
books.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 271360 entries, 0 to 271359
Data columns (total 6 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   ISBN                 271360 non-null  object
 1   Book-Title           271360 non-null  object
 2   Book-Author          271358 non-null  object
 3   Year-Of-Publication  271360 non-null  object
 4   Publisher            271358 non-null  object
 5   Image-URL-L          271357 non-null  object
dtypes: object(6)
memory usage: 12.4+ MB

In [36]:
# Lets remane some wierd columns name
books.rename(columns={"Book-Title":'title',
                      'Book-Author':'author',
                     "Year-Of-Publication":'year',
                     "Publisher":"publisher",
                     "Image-URL-L":"image_url"},inplace=True)

In [38]:
books.head(2)

,ISBN,title,author,year,publisher,image_url
0,0195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press,http://images.amazon.com/images/P/0195153448.0...
1,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,http://images.amazon.com/images/P/0002005018.0...

In [40]:
# Now load the second dataframe

users = pd.read_csv('BX-Users.csv', encoding='ISO-8859-1', sep=';', on_bad_lines='skip', low_memory=False)

In [41]:
users.head(2)

   User-ID                   Location   Age
0        1         nyc, new york, usa   NaN
1        2  stockton, california, usa  18.0

In [42]:
users.shape

(278858, 3)

In [43]:
users.rename(columns={"User-ID": "user_id",
                      "Location": "location",
                      "Age": "age"
                      },inplace=True)

In [44]:
users.head(2)

   user_id                   location   age
0        1         nyc, new york, usa   NaN
1        2  stockton, california, usa  18.0

In [45]:
# Now load the third dataframe

ratings = pd.read_csv('BX-Book-Ratings.csv', encoding='ISO-8859-1', sep=';', on_bad_lines='skip', low_memory=False)

In [46]:
ratings.head(2)

   User-ID        ISBN  Book-Rating
0   276725  034545104X            0
1   276726  0155061224            5

In [47]:
# Lets remane some wierd columns name
ratings.rename(columns={"User-ID": "user_id",
                        "Book-Rating": "rating"
                        }, inplace=True)

In [48]:
ratings.head(2)

   user_id        ISBN  rating
0   276725  034545104X       0
1   276726  0155061224       5

In [51]:
books.shape

(271360, 6)

In [52]:
users.shape

(278858, 3)

In [53]:
ratings.shape

(1149780, 3)

In [54]:
print(books.shape, users.shape, ratings.shape, sep='\n')

(271360, 6)
(278858, 3)
(1149780, 3)